In [44]:
import pandas as pd
import numpy as np

In [45]:
A = pd.DataFrame({
    'A': [[1],[2],[3],[4],[5]],
    'B': [1,2,3,4,5]
})
A

     A  B
0  [1]  1
1  [2]  2
2  [3]  3
3  [4]  4
4  [5]  5

In [46]:
B = pd.DataFrame({
    'A': [[11],[21],[31],[41],[51]],
    'B': [1,2,3,4,5]
})
B

      A  B
0  [11]  1
1  [21]  2
2  [31]  3
3  [41]  4
4  [51]  5

In [48]:
C = pd.concat([A,B], axis = 1)
C

     A  B     A  B
0  [1]  1  [11]  1
1  [2]  2  [21]  2
2  [3]  3  [31]  3
3  [4]  4  [41]  4
4  [5]  5  [51]  5

In [50]:
C.columns = ["A","B","C","D"]
C

     A  B     C  D
0  [1]  1  [11]  1
1  [2]  2  [21]  2
2  [3]  3  [31]  3
3  [4]  4  [41]  4
4  [5]  5  [51]  5

In [53]:
C = C[["A","C","D"]]
C

     A     C  D
0  [1]  [11]  1
1  [2]  [21]  2
2  [3]  [31]  3
3  [4]  [41]  4
4  [5]  [51]  5

In [56]:
C['F'] = C['A']+C['C']
C

     A     C  D        F
0  [1]  [11]  1  [1, 11]
1  [2]  [21]  2  [2, 21]
2  [3]  [31]  3  [3, 31]
3  [4]  [41]  4  [4, 41]
4  [5]  [51]  5  [5, 51]